In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.164696  1.290279  0.343874  1.647127
B  0.382843 -1.151757 -0.552791 -0.423841
C  0.602717 -0.584062 -0.658357 -2.317335
D -0.778500 -1.183111  1.509428 -1.757053
E -1.691293  0.834165  0.716746  0.614427

In [10]:
df['W'] #Menampilkan kolom W (spesifik)

A   -0.529769
B    0.480674
C    0.689427
D    0.684741
E    1.003791
Name: W, dtype: float64

In [12]:
df.W #Tidak direcomendasikan

A   -0.529769
B    0.480674
C    0.689427
D    0.684741
E    1.003791
Name: W, dtype: float64

In [13]:
df[['W', 'Z']] #Menampilkan 2 kolom

          W         Z
A -0.529769 -1.532755
B  0.480674  0.470027
C  0.689427 -0.486411
D  0.684741  1.237695
E  1.003791 -0.475077

In [15]:
df[['X','Y','Z']] # Menampilkan 3 kolom

          X         Y         Z
A  0.843414  1.363649 -1.532755
B  1.791961 -0.552822  0.470027
C  1.611881  1.164027 -0.486411
D  0.323384  0.573744  1.237695
E  1.246755 -0.725670 -0.475077

In [16]:
df['Baru'] = df['W'] + df['Y'] # Menambah kolom baru

In [17]:
df

          W         X         Y         Z      Baru
A -0.529769  0.843414  1.363649 -1.532755  0.833880
B  0.480674  1.791961 -0.552822  0.470027 -0.072148
C  0.689427  1.611881  1.164027 -0.486411  1.853454
D  0.684741  0.323384  0.573744  1.237695  1.258484
E  1.003791  1.246755 -0.725670 -0.475077  0.278121

In [20]:
df.drop('Baru',axis=1) # Axis : 0 adalah index dan 1 adalah kolom, Drop : Hapus

          W         X         Y         Z
A -0.529769  0.843414  1.363649 -1.532755
B  0.480674  1.791961 -0.552822  0.470027
C  0.689427  1.611881  1.164027 -0.486411
D  0.684741  0.323384  0.573744  1.237695
E  1.003791  1.246755 -0.725670 -0.475077

In [21]:
df

          W         X         Y         Z      Baru
A -0.529769  0.843414  1.363649 -1.532755  0.833880
B  0.480674  1.791961 -0.552822  0.470027 -0.072148
C  0.689427  1.611881  1.164027 -0.486411  1.853454
D  0.684741  0.323384  0.573744  1.237695  1.258484
E  1.003791  1.246755 -0.725670 -0.475077  0.278121

In [22]:
df.drop('Baru',axis=1,inplace=True) # parameter inplace supaya data dpt terhapus (-tdk menampilkan datanya, harus ditambahkan df)

In [23]:
df

          W         X         Y         Z
A -0.529769  0.843414  1.363649 -1.532755
B  0.480674  1.791961 -0.552822  0.470027
C  0.689427  1.611881  1.164027 -0.486411
D  0.684741  0.323384  0.573744  1.237695
E  1.003791  1.246755 -0.725670 -0.475077

In [24]:
df.drop('E',axis=0) # hapus baris (axis=0)

          W         X         Y         Z
A -0.529769  0.843414  1.363649 -1.532755
B  0.480674  1.791961 -0.552822  0.470027
C  0.689427  1.611881  1.164027 -0.486411
D  0.684741  0.323384  0.573744  1.237695

In [25]:
df.loc['A'] # Menampilkan baris/index A (loc)

W   -0.529769
X    0.843414
Y    1.363649
Z   -1.532755
Name: A, dtype: float64

In [28]:
df.iloc[2] # Menampilkan dengan index default (iloc)

W    0.689427
X    1.611881
Y    1.164027
Z   -0.486411
Name: C, dtype: float64

In [30]:
df.loc['C','Z'] # Menampilkan baris c dan z

-0.4864111367486261

In [31]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.529769  1.363649
B  0.480674 -0.552822

In [32]:
df > 0 # Bentuk boolean

       W     X      Y      Z
A  False  True   True  False
B   True  True  False   True
C   True  True   True  False
D   True  True   True   True
E   True  True  False  False

In [33]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.843414  1.363649       NaN
B  0.480674  1.791961       NaN  0.470027
C  0.689427  1.611881  1.164027       NaN
D  0.684741  0.323384  0.573744  1.237695
E  1.003791  1.246755       NaN       NaN

In [34]:
df[df['W']>0] # Kolom W diatas 0 atau nilai True

          W         X         Y         Z
B  0.480674  1.791961 -0.552822  0.470027
C  0.689427  1.611881  1.164027 -0.486411
D  0.684741  0.323384  0.573744  1.237695
E  1.003791  1.246755 -0.725670 -0.475077

In [36]:
df[df['W']>0]['Y'] # Menampilkan 1 kolom (['Y'])

B   -0.552822
C    1.164027
D    0.573744
E   -0.725670
Name: Y, dtype: float64

In [37]:
df[df['W']>0][['Y','Z']] # Menampilkan 2 kolom ([['Y','Z']])

          Y         Z
B -0.552822  0.470027
C  1.164027 -0.486411
D  0.573744  1.237695
E -0.725670 -0.475077

In [40]:
df[(df['W']>0) & (df['X']>1)] # Menampilkan W > 0 dan x > 1

          W         X         Y         Z
B  0.480674  1.791961 -0.552822  0.470027
C  0.689427  1.611881  1.164027 -0.486411
E  1.003791  1.246755 -0.725670 -0.475077

In [41]:
df[(df['W']>0) | (df['X']>1)] # Menampilkan W > 0 atau X > 1

          W         X         Y         Z
B  0.480674  1.791961 -0.552822  0.470027
C  0.689427  1.611881  1.164027 -0.486411
D  0.684741  0.323384  0.573744  1.237695
E  1.003791  1.246755 -0.725670 -0.475077

In [5]:
df.reset_index() # Merubah index defaultnya (aslinya) (reset_index)

  index         W         X         Y         Z
0     A  0.164696  1.290279  0.343874  1.647127
1     B  0.382843 -1.151757 -0.552791 -0.423841
2     C  0.602717 -0.584062 -0.658357 -2.317335
3     D -0.778500 -1.183111  1.509428 -1.757053
4     E -1.691293  0.834165  0.716746  0.614427

In [7]:
df['Kode'] = "INA IND JPN RSA USA".split() # Menambahkan kolom

In [8]:
df

          W         X         Y         Z Kode
A  0.164696  1.290279  0.343874  1.647127  INA
B  0.382843 -1.151757 -0.552791 -0.423841  IND
C  0.602717 -0.584062 -0.658357 -2.317335  JPN
D -0.778500 -1.183111  1.509428 -1.757053  RSA
E -1.691293  0.834165  0.716746  0.614427  USA

In [9]:
df.set_index('Kode') #Kolom jadi index (set_index)

             W         X         Y         Z
Kode
INA   0.164696  1.290279  0.343874  1.647127
IND   0.382843 -1.151757 -0.552791 -0.423841
JPN   0.602717 -0.584062 -0.658357 -2.317335
RSA  -0.778500 -1.183111  1.509428 -1.757053
USA  -1.691293  0.834165  0.716746  0.614427

In [10]:
df

          W         X         Y         Z Kode
A  0.164696  1.290279  0.343874  1.647127  INA
B  0.382843 -1.151757 -0.552791 -0.423841  IND
C  0.602717 -0.584062 -0.658357 -2.317335  JPN
D -0.778500 -1.183111  1.509428 -1.757053  RSA
E -1.691293  0.834165  0.716746  0.614427  USA

In [11]:
df.set_index('Kode', inplace=True) #Tambahkan inplace=True jika tidak ada perubahan yg dihapus

In [12]:
df

             W         X         Y         Z
Kode
INA   0.164696  1.290279  0.343874  1.647127
IND   0.382843 -1.151757 -0.552791 -0.423841
JPN   0.602717 -0.584062 -0.658357 -2.317335
RSA  -0.778500 -1.183111  1.509428 -1.757053
USA  -1.691293  0.834165  0.716746  0.614427

In [20]:
dataLabels = ['G1','G1','G1','G2','G2','G2'] # data array (Group 1 dan 2)
dataValue = [1,2,3,1,2,3] # data array
data = list(zip(dataLabels,dataValue)) # List:mengekstrak data yg sudah digabungkan dari zip, Zip:Menggabungkan 2 array/lebih menjadi dalam 1 tuple

data = pd.MultiIndex.from_tuples(data) # Membuat index dari tuple, Tuple: Kumpulan data yg tidak bisa dihapus dan diubah tapi dpt masukan nilai

In [21]:
zip(dataLabels,dataValue) # Menggabungkan 2 array/lebih menjadi dalam 1 tuple

In [22]:
list(zip(dataLabels,dataValue)) #List:mengekstrak data yg sudah digabungkan dari zip, Zip:Menggabungkan 2 array/lebih menjadi dalam 1 tuple

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [23]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [33]:
df = pd.DataFrame(np.random.randn(6,2), index=data,columns=['A','B']) # Data random dengan MultiIndex

In [45]:
df

                 A         B
Group No
G1    1  -0.594956  0.947394
      2   0.338329 -0.385106
      3   0.058814 -0.615938
G2    1  -0.189326  1.032438
      2   0.578385  0.950148
      3   0.092304 -0.831419

In [46]:
df.loc['G1'] # Menampilkan index G1

           A         B
No
1  -0.594956  0.947394
2   0.338329 -0.385106
3   0.058814 -0.615938

In [47]:
df.loc['G1'].loc[3] # Menampilkan index G1 baris ke 3

A    0.058814
B   -0.615938
Name: 3, dtype: float64

In [48]:
df.index.names # Melihat nama index

FrozenList(['Group', 'No'])

In [50]:
df.index.names = ['Group','No'] # Memberi nama index

In [51]:
df

                 A         B
Group No
G1    1  -0.594956  0.947394
      2   0.338329 -0.385106
      3   0.058814 -0.615938
G2    1  -0.189326  1.032438
      2   0.578385  0.950148
      3   0.092304 -0.831419

In [40]:
df.xs('G1') # Menampilkan index G1 (xs sama seperti loc)

           A         B
No
1  -0.594956  0.947394
2   0.338329 -0.385106
3   0.058814 -0.615938

In [43]:
df.xs(['G2',2]) # Menampilkan index G2 baris ke 2

A    0.578385
B    0.950148
Name: (G2, 2), dtype: float64

In [56]:
df.xs(1, level='No') # Menampilkan sub index dari kolom nomer 1

              A         B
Group
G1    -0.594956  0.947394
G2    -0.189326  1.032438